/*
    2026.8.27 13:51
    目的：测试for语句使用
    功能：实现1 + 1/2 + 1/3 + ... + 1/100 和的输出
*/

#include <stdio.h>

int main(void)
{
    int i;
    float sum = 0.0;

    for(i=1; i<=100; i++)
    {
        sum = sum + (1 / (float)i);
        //由于C中的除法特性，两个整型相除，只会的得到整数
        //因此用 (float) 强制类型转换 将i值转化为浮点数
        //sum = sum + (float)(1 / i) 是错误的
        //更简单的写法为： sum = sum + (1.0 / i)
    }

    printf("1 + 1/2 + 1/3 + ... + 1/100 的和为 %f\n",sum);

    return 0;
}

/*
    在VScode中的输出结果是:
 ----------------------
 1 + 1/2 + 1/3 + ... + 1/100 的和为 5.187378
 ----------------------
*/