/*
    2026.8.29 14:23
    目的：测试while语句的使用
    功能：从键盘输入一个数字
          如果数字是回文数
          则返回yes，否则返回no
*/

#include <stdio.h>

int main(void)
{
    //变量
    int val;  //存放待判断的数字
    int m;
    int sum = 0;

    //输入
    printf("请输入您需要判断的数字: ");
    scanf("%d", &val);

    //换位求和
    m = val;
    while (m)
    {
        sum = sum * 10 + m%10;
        m /= 10;
    }

    //判断
    if(sum == val)
        printf("Yes!\n");
    else
        printf("No!\n");
    
    return 0;
}

/*
   while的试数过程
1> m = 1234  成立
   sum = 0*10 + 1234 % 10 = 4
   m = 1234 / 10 = 123

2> m = 123   成立
   sum = 4*10 + 123 % 10 = 43
   m = 123 / 10 = 12

3> m = 12    成立
   sum = 43 * 10 + 12 % 10 = 432
   m = 12 / 10 = 1

4> m = 1     成立
   sum = 432 * 10 + 1 % 10 = 4321
   m = 1 / 10 = 0

5> m = 0 不成立  最终得 sum = 4321
由上，可得对应程序有将数字颠倒功能
*/

/*
    在VScode中的输出结果是:
 ----------------------
 请输入您需要判断的数字: 12
 No!

 请输入您需要判断的数字: 12321
 Yes!
 ----------------------
*/