/*
    2026.9.1 15:13
    目的：学习二维数组的输出
    功能：将二维数组的元素一一进行输出
*/

#include <stdio.h>

int main(void)
{
    //定义二维数组
    int a[3][4] = {
        {1, 2, 3, 4},
        {5, 6, 7, 8},
        {9, 10, 11, 12}
    };

    //输出二维数组
    for(int i=0; i<3; ++i)
    {
        for(int j=0; j<4; ++j)
            printf("%-5d  ", a[i][j]);
            //%-5d, 其中'-'为左对齐
            //'5'表示对应值所占光标位置

        printf("\n");
    }

    return 0;
}

/*
    在VScode中的输出结果是:
 ----------------------
 1      2      3      4      
 5      6      7      8      
 9      10     11     12
 ----------------------
*/